In [ ]:
import pandas as pd
import numpy as np
import pathlib
# from pathlib import Path

In [6]:
csv_path = pathlib.Path(r"C:\Users\user\Desktop\div\data\1.04. Real-life example.csv")
df = pd.read_csv(csv_path)
df

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500
3,Audi,23000.0,crossover,240,4.2,Petrol,yes,2007,Q7
4,Toyota,18300.0,crossover,120,2.0,Petrol,yes,2011,Rav 4
...,...,...,...,...,...,...,...,...,...
4340,Mercedes-Benz,125000.0,sedan,9,3.0,Diesel,yes,2014,S 350
4341,BMW,6500.0,sedan,1,3.5,Petrol,yes,1999,535
4342,BMW,8000.0,sedan,194,2.0,Petrol,yes,1985,520
4343,Toyota,14200.0,sedan,31,NaN,Petrol,yes,2014,Corolla
4344,Volkswagen,13500.0,van,124,2.0,Diesel,yes,2013,T5 (Transporter)

In [11]:
df_yeni = df.copy()
df_yeni.set_index('Brand', inplace=True)

yeni_cols = [
['General', 'General', 'General', 'General', 'Main', 'Main', 'Main', 'Main'],
['Price', 'Body', 'Mileage', 'EngineV', 'Engine Type', 'Registration', 'Year', 'Model']
]

df_yeni.columns = yeni_cols
df_yeni.head(3)

               General                               Main                     \
                 Price   Body Mileage EngineV Engine Type Registration  Year
Brand
BMW             4200.0  sedan     277     2.0      Petrol          yes  1991
Mercedes-Benz   7900.0    van     427     2.9      Diesel          yes  1999
Mercedes-Benz  13300.0  sedan     358     5.0         Gas          yes  2003


                      Model
Brand
BMW                     320
Mercedes-Benz  Sprinter 212
Mercedes-Benz         S 500

In [21]:
mask = df_yeni.loc[:, ('General', 'Body')] != 'sedan'
df_yeni.loc[mask]

                General                                   Main               \
                  Price       Body Mileage EngineV Engine Type Registration
Brand
Mercedes-Benz    7900.0        van     427     2.9      Diesel          yes
Audi            23000.0  crossover     240     4.2      Petrol          yes
Toyota          18300.0  crossover     120     2.0      Petrol          yes
Mercedes-Benz  199999.0  crossover       0     5.5      Petrol          yes
Audi            14200.0      vagon     200     2.7      Diesel          yes
...                 ...        ...     ...     ...         ...          ...
Renault          7000.0        van     210     1.5      Diesel          yes
BMW             12090.0      hatch     145     1.6      Petrol          yes
Renault          2100.0      vagon     237     1.9      Diesel           no
Volkswagen      11500.0        van     163     2.5      Diesel          yes
Volkswagen      13500.0        van     124     2.0      Diesel          yes


               Year              Model
Brand
Mercedes-Benz  1999       Sprinter 212
Audi           2007                 Q7
Toyota         2011              Rav 4
Mercedes-Benz  2016             GLS 63
Audi           2006                 A6
...             ...                ...
Renault        2005             Kangoo
BMW            2010                116
Renault        2001             Laguna
Volkswagen     2008   T5 (Transporter)
Volkswagen     2013  T5 (Transporter)

[2696 rows x 8 columns]

In [26]:
df.head(3)

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500

In [44]:
mask_c = df['Body'] == 'crossover'
mask_h = df['Body'] == 'hatch'
# df.loc[mask_c | mask_h, :].groupby(['Brand', 'Body'])['Price'].sum()
df.loc[mask_c | mask_h, :].groupby(['Brand', 'Body']).agg({
    'Price' : 'sum',
    'Mileage' : 'mean',
    'Model' : 'nunique',
    # 'Model' : 'unique',
})

                              Price     Mileage  Model
Brand         Body
Audi          crossover  2856303.25   98.753247      5
              hatch       367214.00  123.157895      6
BMW           crossover  7342248.00  103.125654      7
              hatch       226112.00  109.750000      7
Mercedes-Benz crossover  9490101.00   90.148810     31
              hatch       336956.00  126.391304     11
Mitsubishi    crossover  2165697.85  121.875912      7
              hatch        90435.25  204.473684      5
Renault       crossover   263093.41   72.263158      6
              hatch       302317.15  124.658537     10
Toyota        crossover  7202984.94  114.273543     17
              hatch       586874.39   96.101695      7
Volkswagen    crossover  2514893.55  109.779070      6
              hatch       904019.78  153.723214     16

In [25]:
df.groupby(['Brand', 'Body'])['Price'].sum()

Brand          Body
Audi           crossover    2856303.25
               hatch         367214.00
               other         990265.00
               sedan        2961797.75
               vagon         993838.00
               van             3000.00
BMW            crossover    7342248.00
               hatch         226112.00
               other        1400452.00
               sedan        6161624.25
               vagon         608035.00
Mercedes-Benz  crossover    9490101.00
               hatch         336956.00
               other        4434401.00
               sedan        8378068.00
               vagon         238490.00
               van          3200041.00
Mitsubishi     crossover    2165697.85
               hatch          90435.25
               other         306371.20
               sedan         980414.00
               vagon          61600.00
               van            43997.00
Renault        crossover     263093.41
               hatch         302317.15
               other         293935.00
               sedan         415068.28
               vagon         905217.28
               van          1484386.80
Toyota         crossover    7202984.94
               hatch         586874.39
               other         885008.00
               sedan        2787515.63
               vagon         181775.25
               van           171050.00
Volkswagen     crossover    2514893.55
               hatch         904019.78
               other        1082566.00
               sedan        3302031.23
               vagon         900857.14
               van          3213375.58
Name: Price, dtype: float64

In [59]:
s_brand_avg = df.groupby('Brand')['Price'].transform('mean')
df['brand_avg'] = s_brand_avg
df

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model,brand_avg
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320,23525.368087
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212,30608.048122
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500,30608.048122
3,Audi,23000.0,crossover,240,4.2,Petrol,yes,2007,Q7,18489.633484
4,Toyota,18300.0,crossover,120,2.0,Petrol,yes,2011,Rav 4,22591.220287
...,...,...,...,...,...,...,...,...,...,...
4340,Mercedes-Benz,125000.0,sedan,9,3.0,Diesel,yes,2014,S 350,30608.048122
4341,BMW,6500.0,sedan,1,3.5,Petrol,yes,1999,535,23525.368087
4342,BMW,8000.0,sedan,194,2.0,Petrol,yes,1985,520,23525.368087
4343,Toyota,14200.0,sedan,31,NaN,Petrol,yes,2014,Corolla,22591.220287
4344,Volkswagen,13500.0,van,124,2.0,Diesel,yes,2013,T5 (Transporter),13125.267930

In [76]:
df.groupby('Brand')['Price'].mean()
df2 = df.groupby('Brand', as_index=False).agg({
    'Price' : 'mean'
})
df3 = df.drop('brand_avg', axis='columns')
pd.merge(df3, df2, how='left', on='Brand').head(3)

,Brand,Price_x,Body,Mileage,EngineV,Engine Type,Registration,Year,Model,Price_y
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320,23525.368087
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212,30608.048122
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500,30608.048122

In [85]:
df.head(3)

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model,brand_avg
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320,23525.368087
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212,30608.048122
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500,30608.048122

In [96]:
df.groupby('Model').filter(
    lambda balaca_df : balaca_df['EngineV'].min() > 2
    ).head()

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model,brand_avg
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212,30608.048122
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500,30608.048122
3,Audi,23000.0,crossover,240,4.2,Petrol,yes,2007,Q7,18489.633484
5,Mercedes-Benz,199999.0,crossover,0,5.5,Petrol,yes,2016,GLS 63,30608.048122
12,Audi,9500.0,vagon,165,2.7,Gas,yes,2003,A6 Allroad,18489.633484

In [108]:
df.groupby(['Brand', 'Body']).agg({'Price':'mean'}).head(5)

                        Price
Brand Body
Audi  crossover  39127.441781
      hatch      20400.777778
      other      28293.285714
      sedan      14171.281100
      vagon       9375.830189

In [112]:
df_g = df.groupby(['Brand', 'Body']).agg({'Price':'mean'})
df_g.unstack()

                      Price                                            \
Body              crossover         hatch         other         sedan
Brand
Audi           39127.441781  20400.777778  28293.285714  14171.281100
BMW            41955.702857  20555.636364  23736.474576  16129.906414
Mercedes-Benz  66831.697183  14650.260870  33092.544776  23080.077135
Mitsubishi     16042.206296   4759.750000  11783.507692   7659.484375
Renault        13847.021579   7373.589024   8645.147059   7156.349655
Toyota         34137.369384  10296.041930  23919.135135  14078.361768
Volkswagen     29586.982941   8218.361636  11640.494624  12413.651241


Body                  vagon           van
Brand
Audi            9375.830189   3000.000000
BMW            14477.023810           NaN
Mercedes-Benz  11924.500000  18823.770588
Mitsubishi      7700.000000   6285.285714
Renault         8381.641481   7573.402041
Toyota         15147.937500  21381.250000
Volkswagen      9583.586596  12359.136846

In [111]:
df.pivot_table(
    values='Price',
    index='Brand',
    columns='Body',
    aggfunc = 'mean',
)

Body,crossover,hatch,other,sedan,vagon,van
Brand,,,,,,
Audi,39127.441781,20400.777778,28293.285714,14171.281100,9375.830189,3000.000000
BMW,41955.702857,20555.636364,23736.474576,16129.906414,14477.023810,NaN
Mercedes-Benz,66831.697183,14650.260870,33092.544776,23080.077135,11924.500000,18823.770588
Mitsubishi,16042.206296,4759.750000,11783.507692,7659.484375,7700.000000,6285.285714
Renault,13847.021579,7373.589024,8645.147059,7156.349655,8381.641481,7573.402041
Toyota,34137.369384,10296.041930,23919.135135,14078.361768,15147.937500,21381.250000
Volkswagen,29586.982941,8218.361636,11640.494624,12413.651241,9583.586596,12359.136846

In [117]:
df_g.reset_index().to_excel('cars_yeni.xlsx')

In [119]:
df.head(3)

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model,brand_avg
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320,23525.368087
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212,30608.048122
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500,30608.048122

In [ ]:
df.dtypes
df.info()

Brand            object
Price           float64
Body             object
Mileage           int64
EngineV         float64
Engine Type      object
Registration     object
Year              int64
Model            object
brand_avg       float64
dtype: object

In [124]:
'BMW' + '2'

'BMW2'

In [129]:
df['Price'].sum()

np.float64(81034430.96000001)

In [135]:
df['Brand']

0                 BMW
1       Mercedes-Benz
2       Mercedes-Benz
3                Audi
4              Toyota
            ...
4340    Mercedes-Benz
4341              BMW
4342              BMW
4343           Toyota
4344       Volkswagen
Name: Brand, Length: 4345, dtype: object

In [144]:
df['Brand'].str.lower().str.contains('mazda')

0       False
1       False
2       False
3       False
4       False
        ...
4340    False
4341    False
4342    False
4343    False
4344    False
Name: Brand, Length: 4345, dtype: bool

In [ ]:
df['Brand'].str.translate()

In [157]:
df['Brand'].str.replace('Toy', 'Yas', regex=False)

0                 BMW
1       Mercedes-Benz
2       Mercedes-Benz
3                Audi
4              Yasota
            ...
4340    Mercedes-Benz
4341              BMW
4342              BMW
4343           Yasota
4344       Volkswagen
Name: Brand, Length: 4345, dtype: object

In [158]:
from datetime import datetime, timedelta

In [ ]:
bd = datetime(year=1999, month=10, day=28)
today = datetime.today()
today

datetime.datetime(2025, 12, 20, 20, 46, 22, 512490)

In [176]:
today.hour

20

In [174]:
td = today - bd
td

datetime.timedelta(days=9550, seconds=74782, microseconds=512490)

In [179]:
pd.Timestamp(today) - pd.Timestamp(bd)

Timedelta('9550 days 20:46:22.512490')

In [180]:
pd.to_datetime([bd, today])

DatetimeIndex(['1999-10-28 00:00:00', '2025-12-20 20:46:22.512490'], dtype='datetime64[ns]', freq=None)

In [190]:
pd.timedelta_range(start='1 days', periods=2)

TimedeltaIndex(['1 days', '2 days'], dtype='timedelta64[ns]', freq='D')

In [191]:
pd.to_datetime([bd, today]) + pd.timedelta_range(start='1 days', periods=2)

DatetimeIndex(['1999-10-29 00:00:00', '2025-12-22 20:46:22.512490'], dtype='datetime64[ns]', freq=None)

In [ ]:
%pip install yfinance

Requirement already satisfied: yfinance in c:\users\user\miniconda3\envs\ds\lib\site-packages (0.2.66)
Requirement already satisfied: pandas>=1.3.0 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (2.3.3)
Requirement already satisfied: numpy>=1.16.5 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (2.2.6)
Requirement already satisfied: requests>=2.31 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (2.32.5)
Requirement already satisfied: multitasking>=0.0.7 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (0.0.12)
Requirement already satisfied: platformdirs>=2.0.0 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (4.5.0)
Requirement already satisfied: pytz>=2022.5 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (2025.2)
Requirement already satisfied: frozendict>=2.3.4 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (2.4.7)
Requirement already satisfied: peewee>=3.16.2 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (3.18.3)
Requirement already satisfied: beautifulsoup4>=4.11.1 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (4.14.2)
Requirement already satisfied: curl_cffi>=0.7 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (0.13.0)
Requirement already satisfied: protobuf>=3.19.0 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (6.33.1)
Requirement already satisfied: websockets>=13.0 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from yfinance) (15.0.1)
Requirement already satisfied: soupsieve>1.2 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.8)
Requirement already satisfied: typing-extensions>=4.0.0 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (4.15.0)
Requirement already satisfied: cffi>=1.12.0 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from curl_cffi>=0.7->yfinance) (2.0.0)
Requirement already satisfied: certifi>=2024.2.2 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from curl_cffi>=0.7->yfinance) (2025.11.12)
Requirement already satisfied: pycparser in c:\users\user\miniconda3\envs\ds\lib\site-packages (from cffi>=1.12.0->curl_cffi>=0.7->yfinance) (2.23)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from pandas>=1.3.0->yfinance) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from pandas>=1.3.0->yfinance) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from python-dateutil>=2.8.2->pandas>=1.3.0->yfinance) (1.17.0)
Requirement already satisfied: charset_normalizer<4,>=2 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from requests>=2.31->yfinance) (3.4.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from requests>=2.31->yfinance) (3.11)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\user\miniconda3\envs\ds\lib\site-packages (from requests>=2.31->yfinance) (2.5.0)
Note: you may need to restart the kernel to use updated packages.

In [193]:
import yfinance as yf
import datetime

start_date = datetime.datetime(2023, 1, 1)
end_date = datetime.datetime.today()

data = yf.download(
    ['NVDA'], 
    start=start_date,
    end=end_date
)

C:\Users\user\AppData\Local\Temp\ipykernel_5916\1740432447.py:7: FutureWarning: YF.download() has changed argument auto_adjust default to True
  data = yf.download(
[*********************100%***********************]  1 of 1 completed

In [197]:
data = data.droplevel(1, axis='columns')
data

Price            Close        High         Low        Open     Volume
Date
2023-01-03   14.300683   14.981003   14.081902   14.836147  401277000
2023-01-04   14.734250   14.838146   14.226759   14.552433  431324000
2023-01-05   14.250735   14.549436   14.133852   14.476509  389168000
2023-01-06   14.844140   14.994989   14.019965   14.459525  405044000
2023-01-09   15.612372   16.039944   15.125859   15.268717  504231000
...                ...         ...         ...         ...        ...
2025-12-15  176.289993  178.419998  175.029999  177.940002  164775600
2025-12-16  177.720001  178.490005  174.899994  176.259995  148588100
2025-12-17  170.940002  176.130005  170.309998  176.100006  222775500
2025-12-18  174.139999  176.149994  171.820007  174.529999  176096000
2025-12-19  180.990005  181.449997  176.339996  176.669998  324372500

[745 rows x 5 columns]

In [198]:
data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 745 entries, 2023-01-03 to 2025-12-19
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   745 non-null    float64
 1   High    745 non-null    float64
 2   Low     745 non-null    float64
 3   Open    745 non-null    float64
 4   Volume  745 non-null    int64
dtypes: float64(4), int64(1)
memory usage: 34.9 KB

In [199]:
data = data['Close']
data

Date
2023-01-03     14.300683
2023-01-04     14.734250
2023-01-05     14.250735
2023-01-06     14.844140
2023-01-09     15.612372
                 ...
2025-12-15    176.289993
2025-12-16    177.720001
2025-12-17    170.940002
2025-12-18    174.139999
2025-12-19    180.990005
Name: Close, Length: 745, dtype: float64

In [203]:
data.loc['2023-12'].mean()

np.float64(48.043328857421876)